import pandas as pd

# لیست داده‌ها
data = [
    ("احمد", "متولی امامی آماده سازی"), ("محمدمتین", "شمسی فلاورجانی"),
    ("علیرضا", "رضایی مارانی"), ("رضا", "شمسی ارمندی"),
    ("سپنتا", "صالحی"), ("مارینا", "حلبیان فر"),
    ("مژگان", "دهنوی"), ("محمد نوید", "طاهری"),
    ("فاطمه", "باقری"), ("محمد امین", "مکتوبیان"),
    ("آرش", "قاسمی"), ("کیوان", "کوه طوری"),
    ("ساناز", "کیوان داریان"), ("عرشیا", "حیدری"),
    ("محمد", "صالحی"), ("محمد", "سعادت"),
    ("ماهان", "احمدی"), ("علیرضا", "ازادی"),
    ("شمیم", "فتاحی"), ("سیامک", "صفری"),
    ("محمود", "راعی"), ("جواد", "احمدی"),
    ("میلاد", "خادم القرانی"), ("محمدباقر", "حسینی"),
    ("محمدابراهیم", "قاسم پور"), ("عرفان", "نصری"),
    ("سعید", "نوری"), ("متین", "آقاجان"),
    ("محمد", "جزینی"), ("کمیل", "باقریان"),
    ("نیما", "عبدالهی"), ("محمد", "حاتمی"),
    ("سمانه", "شفیع زاده"), ("مارال", "حلبیان فر"),
    ("بهراد", "قنبری"), ("علی", "حلبیان"),
    ("مجید", "حلبیان فر"), ("علی", "غلامعلیان")
]

# ایجاد DataFrame
df = pd.DataFrame(data, columns=["نام", "نام خانوادگی"])

# ذخیره به صورت فایل اکسل
file_path = "names_list.xlsx"
df.to_excel(file_path, index=False)

print(file_path)